STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_FindBind_Coord/STM32_WPAN/App/app_zigbee_endpoint.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : app_zigbee_endpoint.c
  * Description        : Zigbee Application to manage endpoints and these clusters.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdint.h>

#include "app_conf.h"
#include "app_common.h"
#include "app_entry.h"
#include "app_zigbee.h"
#include "dbg_trace.h"
#include "ieee802154_enums.h"
#include "mcp_enums.h"

#include "stm32_lpm.h"
#include "stm32_rtos.h"
#include "stm32_timer.h"

#include "zigbee.h"
#include "zigbee.nwk.h"
#include "zigbee.security.h"

/* Private includes -----------------------------------------------------------*/
#include "zcl/zcl.h"
#include "zcl/general/zcl.identify.h"
#include "zcl/general/zcl.scenes.h"
#include "zcl/general/zcl.onoff.h"
#include "zcl/security/zcl.ias_wd.h"
#include "zcl/se/zcl.message.h"

/* USER CODE BEGIN PI */
#include "stm32wbaxx_nucleo.h"

/* USER CODE END PI */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_CHANNEL                13u
#define APP_ZIGBEE_CHANNEL_MASK           ( 1u << APP_ZIGBEE_CHANNEL )
#define APP_ZIGBEE_TX_POWER               ((int8_t) 10)    /* TX-Power is at +10 dBm. */

#define APP_ZIGBEE_ENDPOINT               10u
#define APP_ZIGBEE_PROFILE_ID             ZCL_PROFILE_HOME_AUTOMATION
#define APP_ZIGBEE_DEVICE_ID              ZCL_DEVICE_ONOFF_LIGHT
#define APP_ZIGBEE_GROUP_ADDRESS          0x0001u

#define APP_ZIGBEE_CLUSTER1_ID            ZCL_CLUSTER_IDENTIFY
#define APP_ZIGBEE_CLUSTER1_NAME          "Identify Server"

#define APP_ZIGBEE_CLUSTER2_ID            ZCL_CLUSTER_SCENES
#define APP_ZIGBEE_CLUSTER2_NAME          "Scenes Server"

#define APP_ZIGBEE_CLUSTER3_ID            ZCL_CLUSTER_ONOFF
#define APP_ZIGBEE_CLUSTER3_NAME          "OnOff Server"

#define APP_ZIGBEE_CLUSTER4_ID            ZCL_CLUSTER_IAS_WD
#define APP_ZIGBEE_CLUSTER4_NAME          "IasWd Server"

#define APP_ZIGBEE_CLUSTER5_ID            ZCL_CLUSTER_MESSAGING
#define APP_ZIGBEE_CLUSTER5_NAME          "Messaging Server"

/* Scenes specific defines ----------------------------------------------------*/
#define ZCL_SCENES_MAX_SCENES             10
/* USER CODE BEGIN Scenes defines */
/* USER CODE END Scenes defines */

/* USER CODE BEGIN PD */
#define APP_ZIGBEE_IDENTIFY_MODE_DELAY    30u   /* 30s  */

#define APP_ZIGBEE_APPLICATION_NAME       "Find-Bind Coordinator"
#define APP_ZIGBEE_APPLICATION_OS_NAME    "."

// -- Redefine tasks & priorities to better code read --
#define CFG_TASK_ZIGBEE_APP_IAS_WD_START_WARNING        CFG_TASK_ZIGBEE_APP1
#define TASK_ZIGBEE_APP_IAS_WD_START_WARNING_PRIORITY   CFG_SEQ_PRIO_0

#define CFG_TASK_ZIGBEE_APP_IAS_WD_SQUAWK               CFG_TASK_ZIGBEE_APP2
#define TASK_ZIGBEE_APP_IAS_WD_SQUAWK_PRIORITY          CFG_SEQ_PRIO_0

/* USER CODE END PD */

// -- Redefine Clusters to better code read --
#define IdentifyServer                    pstZbCluster[0]
#define ScenesServer                      pstZbCluster[1]
#define OnOffServer                       pstZbCluster[2]
#define IasWdServer                       pstZbCluster[3]
#define MessagingServer                   pstZbCluster[4]

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private constants ---------------------------------------------------------*/
/* USER CODE BEGIN PC */
const uint8_t     pszMessageBuffer[] = "ZCL Test Message";

/* USER CODE END PC */

/* Private variables ---------------------------------------------------------*/
static uint16_t   iDeviceShortAddress;

/* USER CODE BEGIN PV */
static bool       bIsSquawkStrobe = false;
static struct ZbZclIasWdClientStartWarningReqT  stWarningRequest;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

/* OnOff Server Callbacks */
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerOffCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg );
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerOnCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg );
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerToggleCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg );

static struct ZbZclOnOffServerCallbacksT stOnOffServerCallbacks =
{
  .off = APP_ZIGBEE_OnOffServerOffCallback,
  .on = APP_ZIGBEE_OnOffServerOnCallback,
  .toggle = APP_ZIGBEE_OnOffServerToggleCallback,
};

/* IasWd Server Callbacks */
static enum ZclStatusCodeT APP_ZIGBEE_IasWdServerStartWarningCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclIasWdClientStartWarningReqT * pstRequest );
static enum ZclStatusCodeT APP_ZIGBEE_IasWdServerSquawkCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclIasWdClientSquawkReqT * pstRequest );

static struct ZbZclIasWdServerCallbacksT stIasWdServerCallbacks =
{
  .start_warning = APP_ZIGBEE_IasWdServerStartWarningCallback,
  .squawk = APP_ZIGBEE_IasWdServerSquawkCallback,
};

/* Messaging Server Callbacks */
static enum ZclStatusCodeT APP_ZIGBEE_MessagingServerGetLastMessageCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclAddrInfoT * pstSrcInfo );
static enum ZclStatusCodeT APP_ZIGBEE_MessagingServerMessageConfirmationCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclMsgMessageConfT * pstMessageConfirm, struct ZbZclAddrInfoT * pstSrcInfo );

static struct ZbZclMsgServerCallbacksT stMessagingServerCallbacks =
{
  .get_last_message = APP_ZIGBEE_MessagingServerGetLastMessageCallback,
  .message_confirmation = APP_ZIGBEE_MessagingServerMessageConfirmationCallback,
};

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_ApplicationTaskInit                            ( void );

static enum ZclStatusCodeT APP_ZIGBEE_ZclAttributeCallback            ( struct ZbZclClusterT * pstCluster, struct ZbZclAttrCbInfoT * pstCallbackInfo );

static void APP_ZIGBEE_IasWdServerAlarmProcessing                     ( void );
static void APP_ZIGBEE_IasWdServerSquawkProcessing                    ( void );

