STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_FindBind_Coord/STM32_WPAN/App/app_zigbee_endpoint.c
  /* USER CODE END APP_ZIGBEE_SetNewDevice */
}

/**
 * @brief  Print application information to the console
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_PrintApplicationInfo(void)
{
  LOG_INFO_APP( "**********************************************************" );
  LOG_INFO_APP( "Network config : CENTRALIZED COORDINATOR" );

  /* USER CODE BEGIN APP_ZIGBEE_PrintApplicationInfo1 */
  LOG_INFO_APP( "Application Flashed : Zigbee %s %s", APP_ZIGBEE_APPLICATION_NAME, APP_ZIGBEE_APPLICATION_OS_NAME );

  /* USER CODE END APP_ZIGBEE_PrintApplicationInfo1 */
  LOG_INFO_APP( "Channel used: %d.", APP_ZIGBEE_CHANNEL );

  APP_ZIGBEE_PrintGenericInfo();

  LOG_INFO_APP( "Clusters allocated are:" );
  LOG_INFO_APP( "%s on Endpoint %d.", APP_ZIGBEE_CLUSTER1_NAME, APP_ZIGBEE_ENDPOINT );
  LOG_INFO_APP( "%s on Endpoint %d.", APP_ZIGBEE_CLUSTER2_NAME, APP_ZIGBEE_ENDPOINT );
  LOG_INFO_APP( "%s on Endpoint %d.", APP_ZIGBEE_CLUSTER3_NAME, APP_ZIGBEE_ENDPOINT );
  LOG_INFO_APP( "%s on Endpoint %d.", APP_ZIGBEE_CLUSTER4_NAME, APP_ZIGBEE_ENDPOINT );
  LOG_INFO_APP( "%s on Endpoint %d.", APP_ZIGBEE_CLUSTER5_NAME, APP_ZIGBEE_ENDPOINT );

  /* USER CODE BEGIN APP_ZIGBEE_PrintApplicationInfo2 */

  /* USER CODE END APP_ZIGBEE_PrintApplicationInfo2 */

  LOG_INFO_APP( "**********************************************************" );
}

/**
 * @brief  OnOff Server 'Off' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerOffCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_OnOffServerOffCallback */
  uint8_t cEndpoint;

  cEndpoint = ZbZclClusterGetEndpoint( pstCluster );
  if ( cEndpoint == APP_ZIGBEE_ENDPOINT)
  {
    LOG_INFO_APP( "[ONOFF] Red Led 'OFF'" );
    APP_LED_OFF( LED_RED );
    (void)ZbZclAttrIntegerWrite( pstCluster, ZCL_ONOFF_ATTR_ONOFF, 0 );
  }
  else
  {
    /* Unknown endpoint */
    eStatus = ZCL_STATUS_FAILURE;
  }

  /* USER CODE END APP_ZIGBEE_OnOffServerOffCallback */
  return eStatus;
}

/**
 * @brief  OnOff Server 'On' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerOnCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_OnOffServerOnCallback */
  uint8_t   cEndpoint;

  cEndpoint = ZbZclClusterGetEndpoint( pstCluster );
  if ( cEndpoint == APP_ZIGBEE_ENDPOINT )
  {
    LOG_INFO_APP( "[ONOFF] Red Led 'ON'" );
    APP_LED_ON( LED_RED );
    (void)ZbZclAttrIntegerWrite( pstCluster, ZCL_ONOFF_ATTR_ONOFF, 1 );
  }
  else
  {
    /* Unknown endpoint */
    eStatus = ZCL_STATUS_FAILURE;
  }

  /* USER CODE END APP_ZIGBEE_OnOffServerOnCallback */
  return eStatus;
}

/**
 * @brief  OnOff Server 'Toggle' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_OnOffServerToggleCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAddrInfoT * pstSrcInfo, void * arg )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_OnOffServerToggleCallback */
  uint8_t   cAttrVal;

  if ( ZbZclAttrRead( pstCluster, ZCL_ONOFF_ATTR_ONOFF, NULL, &cAttrVal, sizeof(cAttrVal), false) != ZCL_STATUS_SUCCESS )
  {
      eStatus = ZCL_STATUS_FAILURE;
  }
  else
  {
    if ( cAttrVal != 0u )
    {
        eStatus = APP_ZIGBEE_OnOffServerOffCallback( pstCluster, pstSrcInfo, arg );
    }
    else
    {
        eStatus = APP_ZIGBEE_OnOffServerOnCallback( pstCluster, pstSrcInfo, arg );
    }
  }

  /* USER CODE END APP_ZIGBEE_OnOffServerToggleCallback */
  return eStatus;
}

/**
 * @brief  IasWd Server 'StartWarning' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_IasWdServerStartWarningCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclIasWdClientStartWarningReqT * pstRequest )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_IasWdServerStartWarningCallback */
  LOG_INFO_APP( "[IAS WD] IAS WD StartWarning command received." );

  /* Dumping the request parameters */
  LOG_INFO_APP("[IAS WD] Warning mode: 0x%02x.",  pstRequest->warning_mode);
  LOG_INFO_APP("[IAS WD] Warning duration: 0x%04x.",  pstRequest->warning_duration);
  LOG_INFO_APP("[IAS WD] Siren level: 0x%02x.",  pstRequest->siren_level);
  LOG_INFO_APP("[IAS WD] Strobe enabled?  %s.",  (pstRequest->strobe) ? "Yes" : "No");
  LOG_INFO_APP("[IAS WD] Strobe duty cycle: 0x%02x.\n",  pstRequest->strobe_dutycycle);

  /* Activate the warning state */
  memcpy( &stWarningRequest, pstRequest, sizeof( stWarningRequest ) );
  UTIL_SEQ_SetTask(1U << CFG_TASK_ZIGBEE_APP_IAS_WD_START_WARNING, TASK_ZIGBEE_APP_IAS_WD_START_WARNING_PRIORITY );

  /* USER CODE END APP_ZIGBEE_IasWdServerStartWarningCallback */
  return eStatus;
}

/**
 * @brief  IasWd Server 'Squawk' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_IasWdServerSquawkCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclIasWdClientSquawkReqT * pstRequest )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_IasWdServerSquawkCallback */
  LOG_INFO_APP( "[IAS WD] IAS WD Squawk command received.");

  /* Dumping the request parameters */
  LOG_INFO_APP( "[IAS WD] Squawk mode: 0x%02x.",  pstRequest->squawk_mode );
  LOG_INFO_APP( "[IAS WD] Squawk level: 0x%02x.",  pstRequest->squawk_level );
  LOG_INFO_APP( "[IAS WD] Strobe enabled?  %s.",  (pstRequest->strobe) ? "Yes" : "No" );

  LOG_INFO_APP( "[IAS WD] Activating Squawk signal." );
  bIsSquawkStrobe = (bool)pstRequest->strobe;
  UTIL_SEQ_SetTask( 1U << CFG_TASK_ZIGBEE_APP_IAS_WD_SQUAWK, TASK_ZIGBEE_APP_IAS_WD_SQUAWK_PRIORITY );

  /* USER CODE END APP_ZIGBEE_IasWdServerSquawkCallback */
  return eStatus;
}

/**
 * @brief  Messaging Server 'GetLastMessage' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_MessagingServerGetLastMessageCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclAddrInfoT * pstSrcInfo )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_MessagingServerGetLastMessageCallback */
  LOG_INFO_APP( "[MESSAGE] Get Last Message Received" );
  
  /* USER CODE END APP_ZIGBEE_MessagingServerGetLastMessageCallback */
  return eStatus;
}

/**
 * @brief  Messaging Server 'MessageConfirmation' command Callback
 */
static enum ZclStatusCodeT APP_ZIGBEE_MessagingServerMessageConfirmationCallback( struct ZbZclClusterT * pstCluster, void * arg, struct ZbZclMsgMessageConfT * pstMessageConfirm, struct ZbZclAddrInfoT * pstSrcInfo )
{
  enum ZclStatusCodeT   eStatus = ZCL_STATUS_SUCCESS;
  /* USER CODE BEGIN APP_ZIGBEE_MessagingServerMessageConfirmationCallback */
  LOG_INFO_APP( "[MESSAGE] Message Confirm Received" );

  /* USER CODE END APP_ZIGBEE_MessagingServerMessageConfirmationCallback */
  return eStatus;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */

/**
 * @brief  Zigbee application Task initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ApplicationTaskInit( void )
{
  /* Register tasks associated with IAS WD */
  UTIL_SEQ_RegTask( 1U << CFG_TASK_ZIGBEE_APP_IAS_WD_START_WARNING, UTIL_SEQ_RFU, APP_ZIGBEE_IasWdServerAlarmProcessing );
  UTIL_SEQ_RegTask( 1U << CFG_TASK_ZIGBEE_APP_IAS_WD_SQUAWK, UTIL_SEQ_RFU, APP_ZIGBEE_IasWdServerSquawkProcessing );
}

/**
 * @brief  ZCL Attribute write callback handler
 * @param  pstCluster     ZCL Cluster pointer
 * @param  pstSource      Sender info
 * @param  iAttributeId   Attribute ID
 * @param  pDataInput     Data to be written to attribute
 * @param  iInputMaxLen   Max Length of input data
 * @param  pAttrData      Attribute data information
 * @param  stMode         ZCL Write mode
 * @param  arg            Passed argument
 * @retval ZCL Status codexxxxx
 */
static enum ZclStatusCodeT APP_ZIGBEE_ZclAttributesWriteCallback( struct ZbZclClusterT * pstCluster, const struct ZbApsAddrT * pstSource, uint16_t iAttributeId,
                                                                  const uint8_t * pDataInput, unsigned int iInputMaxLen, void * pAttrData, ZclWriteModeT stMode, void * arg )
{
  uint16_t  iLen = 0;

  switch ( iAttributeId ) 
  {
    case ZCL_ONOFF_ATTR_ONOFF:
        iLen = 1;
        (void)memcpy( pAttrData, pDataInput, iLen );
        if ( pDataInput[0] == 1 ) 
        {
          LOG_INFO_APP( "Green Led 'ON'" );
          APP_LED_ON( LED_GREEN );
        }
        else 
        {
          LOG_INFO_APP(  "Green Led 'OFF'" );
          APP_LED_OFF(LED_GREEN);
        }
        return ZCL_STATUS_SUCCESS;

    default:
        return ZCL_STATUS_UNSUPP_ATTRIBUTE;
  }
}

/**
 * @brief  ZCL Attribute read/write callback handler
 * @param  pstCluster       ZCL Cluster pointer
 * @param  pstCallbackInfo  Attribute callback info
 * @retval ZCL Status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_ZclAttributeCallback( struct ZbZclClusterT * pstCluster, struct ZbZclAttrCbInfoT * pstCallbackInfo )
{
  if ( pstCallbackInfo->type == ZCL_ATTR_CB_TYPE_WRITE) 
  {
    return APP_ZIGBEE_ZclAttributesWriteCallback( pstCluster, pstCallbackInfo->src, pstCallbackInfo->info->attributeId, pstCallbackInfo->zcl_data, pstCallbackInfo->zcl_len,
            pstCallbackInfo->attr_data, pstCallbackInfo->write_mode, pstCallbackInfo->app_cb_arg );
  }
  else 
  {
    return ZCL_STATUS_FAILURE;
  }
}

/**
 * @brief  Zigbee application IAS WD StartWarning command processing
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IasWdServerAlarmProcessing( void )
{
  enum ZclStatusCodeT   eStatus;
  enum ZclDataTypeT     eType;
  uint16_t  iWarningDuration;
  uint16_t  iMaxDuration;
  uint16_t  iIndex;

  /* reading local MaxDuration attribute */
  eType = ZCL_DATATYPE_UNSIGNED_16BIT;
  iWarningDuration = stWarningRequest.warning_duration;
  
  iMaxDuration = (uint16_t)ZbZclAttrIntegerRead( stZigbeeAppInfo.IasWdServer, ZCL_IAS_WD_SVR_ATTR_MAX_DURATION, &eType, &eStatus );
  if ( eStatus != ZCL_STATUS_SUCCESS ) 
  {
    LOG_ERROR_APP( "[IAS WD] Error during 'Read Integer Attribute' (0x%02X)", eStatus );
    assert(0);
  }

  /* The alarm cannot last ;ore that MaxDuration attribute value */
  if ( iMaxDuration < iWarningDuration) 
  {
    iWarningDuration = iMaxDuration;
  }

