STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_FindBind_Coord/STM32_WPAN/App/app_zigbee_endpoint.c
  for ( iIndex = 0; iIndex < iWarningDuration ; iIndex++ ) 
  {
    LOG_INFO_APP( "[IAS WD] Alarm!" );
    if ( stWarningRequest.strobe ) 
    {
      /* strobe enabled */
      APP_LED_ON(LED_RED);
      HAL_Delay( stWarningRequest.strobe_dutycycle*10); /* time in ms corresponding to strobe duty cycle */
      APP_LED_OFF(LED_RED);
      HAL_Delay(1000 - stWarningRequest.strobe_dutycycle*10); /* remaining time in 1s */
    } 
    else 
    {
      HAL_Delay(1000);
    }
  }

  LOG_INFO_APP( "[IAS WD] Alarm ended." );
}


/**
 * @brief  Zigbee application IAS WD Squawk command processing
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_IasWdServerSquawkProcessing( void )
{
  uint16_t  iIndex;
  
  for ( iIndex = 0 ; iIndex < 3u ; iIndex++ ) 
  { 
    /* 3 sec loop */
    LOG_INFO_APP( "[IAS WD] Squawk!" );
    if ( bIsSquawkStrobe != false ) 
    {
      APP_LED_ON(LED_RED);
    }
    
    HAL_Delay(100);

    if ( bIsSquawkStrobe != false ) 
    {
      APP_LED_OFF(LED_RED);
    }
    
    HAL_Delay(100);
  }
  
  LOG_INFO_APP( "[IAS WD] Squawk signal ended." );
}

/**
 * @brief  Management of the SW1 button : Put Identify cluster into identify mode.
 * @param  None
 * @retval None
 */
void APPE_Button1Action( void )
{
  /* First, verify if Appli has already Join a Network  */ 
  if ( APP_ZIGBEE_IsAppliJoinNetwork() != false )
  {
    LOG_INFO_APP( "SW1 PUSHED : Turn on 'Identify Mode' during %ds", APP_ZIGBEE_IDENTIFY_MODE_DELAY );
    ZbZclIdentifyServerSetTime( stZigbeeAppInfo.IdentifyServer, APP_ZIGBEE_IDENTIFY_MODE_DELAY );
  }
}


/**
 * @brief  Management of the SW2 button : Send ZCL Display Message request via bindings.
 * @param  None
 * @retval None
 */
void APPE_Button2Action( void )
{
  struct ZbZclMsgMessageT   stMessage;
  enum ZclStatusCodeT       eStatus;
  
  /* First, verify if Appli has already Join a Network  */ 
  if ( APP_ZIGBEE_IsAppliJoinNetwork() != false )
  {
    /* Set Message */
    stMessage.message_id = 1;
    stMessage.duration = 1;
    stMessage.message_str = (uint8_t *)pszMessageBuffer;
    stMessage.message_len = sizeof( pszMessageBuffer );
    
    LOG_INFO_APP( "SW2 PUSHED : Send New Message" );
    eStatus = ZbZclMsgServerDisplayMessageUnsolic( stZigbeeAppInfo.MessagingServer, ZbApsAddrBinding, &stMessage, NULL, NULL );
    if ( eStatus != ZCL_STATUS_SUCCESS) 
    {
      LOG_ERROR_APP("Failed to display New message (0x%02X)", eStatus);
    }
  }
}


/* USER CODE END FD_LOCAL_FUNCTIONS */
